
from sklearn.model_selection import train_test_split
from itertools import zip_longest
import pandas as pd
import os

fd = {
  '付费方式': ["自费", "保险", "医疗救助", "医疗补助", "公费医疗", "自费和医保结合"],
  '状况状态': ["正常", "异常", "稳定", "不稳定", "恶化", "好转", "未知", "待定", "无", "有", "确定", "疑似", "确诊", "未诊断", "建议隔离", "隔离期", "结束隔离", "重症", "轻症", 
           "中度症状", "失访", "死亡"],
  '婚姻状况': ["已婚", "未婚", "离异", "丧偶", "复婚"],
  '就业状态': ["在职", "离职", "退休", "自雇", "无业", "学生", "实习"],
  '宗教信仰': ['基督教', '佛教', '伊斯兰教', '印度教', '犹太教', '道教', '天主教', '东正教', '基督复临安息日会', '耶和华见证人', '摩门教', '神道教', '锡克教', '拜火教', '卡巴拉', 
           '苦行派', '巫教', '新教','一神论', '多神论', '无神论', '泛神论', '全在神中论', '不可知论', '唯一神论', '有神论', '灵性主义', '万物有灵论', '图腾崇拜', '祖先崇拜'],
  
  '麻醉方式': ['全身麻醉', '局部麻醉', '表面麻醉', '脊麻醉', '硬膜外麻醉', '静脉麻醉'],
  '麻醉效果': ['无痛', '轻度疼痛', '中度疼痛', '重度疼痛', '麻痹'],
  '血型': ['A型', 'B型', 'AB型', 'O型','Rh阳性', 'Rh阴性'],
  '药物状态': ['未开封', '已开封', '已过期'],
#   '用药途径':['口服', '外用', '注射', '鼻喉喷雾', '肛门给药', '阴道给药', '眼用'],
#   '影像名称': ['X线胸透', 'CT扫描', 'MRI检查', '超声心动图', '肺功能检查','乳腺X线检查', '胃肠镜检查', '骨密度检查', '眼底照相', '彩超检查', '心电图'],
#   '影像类型': ['CT扫描', 'MRI', '彩超', 'PET扫描', '血管造影'],

  
  '分娩方式': ['自然分娩', '产钳助产', '产瘤助产', '剖腹产'],
  '乳房检查': ['乳腺触诊', '乳腺X线摄影', '乳房超声', '磁共振成像', '乳腺活检'],
  '胎方位': ['头先露', '臀先露', '横位', '斜位', '足先露'],
  
  '病症描述': ['血糖水平高', '血压偏高', '心电图异常', '白细胞计数升高', 'C-反应蛋白升高', '尿蛋白阳性', '肝功能异常', '血脂异常', '肺功能受损'],
  '病症描述': ['胸闷', '心悸', '气促', '疲乏', '冷汗', '恶心', '呕吐', '心前区疼痛', '多尿', '多饮', '多食', '体重下降', '视力模糊', '乏力', '发热', 
           '咳嗽', '气促', '胸痛', '咳痰', '咳嗽',  '活动时气促', '咳痰', '乏力', '食欲减退', '恶心', '呕吐', '发热', '黄疸', '气促', '浮肿', '心悸', 
           '胸闷', '无症状', '头痛', '头晕', '耳鸣', '视力模糊', '月经不调', '闭经', '多毛', '体重波动', '失眠', '情绪不稳', '无症状', '不明原因的体重下降', 
           '发热', '乏力', '疼痛', '腹痛', '腹泻', '便秘', '恶心', '呕吐'],
  '医嘱内容': ['控制饮食、戒烟限酒、进行规律的有氧运动（如快走、游泳等）、服用药物（如阿司匹林、硝酸甘油等）。',
    '控制饮食、规律运动、注射或口服降糖药物及胰岛素等。',
    '休息、维持水分、按时服药、进行必要的氧气治疗、避免交叉感染等。',
    '戒烟、减少空气污染、运动锻炼、使用药物（如吸入性支气管扩张剂、口服或吸入性类固醇等）等。',
    '避免饮酒、控制饮食、规律生活、进行药物治疗等。',
    '禁烟酒，控制饮食，定期复查，严格按医生嘱咐服药，规律的有氧运动等。',
    '戒烟限酒，控制饮食，规律锻炼，按照医生的嘱咐使用降压药物等。',
    '改变生活习惯、调整饮食等，视具体情况进行药物治疗。',
    '手术、放疗、化疗等治疗方式，具体方案根据患者的病情和病理特征进行选择。',
    '忌食刺激性食物、非甘油类泻药，并按照医生嘱咐使用相应药物。',
    '饮食补钙、户外运动、避免长期服用激素和抗癫痫等药物。',
    '决不能服用硝酸甘油等扩血管的药物、避免饮食不良、限制脂肪的摄入、坚持锻炼、防止并发症的发生等。',
    '宜避免接触变态反应源，如花粉、毛发、尘螨等。要嘱患者学会正确使用雾化器和吸入器的方法，保持低盐低脂饮食习惯。',
    '制定合理的饮食计划，避免食用高嘌呤食物，如动物内脏、肉类、海鲜等。保持适当的运动量，避免过度劳累。',
    '按时、按量使用抗结核药，密切监测用药效果，注意肺结核菌的扩散和感染。定期检查肝功能、血常规；保证充足的营养、调整饮食。',
    '饮食要注意富含钙、维生素D，加强锻炼以有利于康复。术后按医生要求进行紧急康复等指导。',
    '注意以清淡饮食为主，提高免疫力。避免抑制免疫系统的药物，如糖皮质激素等。专业治疗。',
    '维持规律的作息时间、提供有趣的活动、保持社交互动，注意照顾患者的情绪和心理状态；根据症状使用相应药物，如乙酰胆碱酯酶抑制剂等。',
    '禁忌饮酒，注意控制食物的脂肪含量。进食时应分次进食，避免辛辣、油腻等食物。',
    '禁忌饮酒，控制饮食，保持营养均衡、易消化、低蛋白、高糖饮食。白蛋白缺乏时可缓慢补充。',
    '控制饮食，避免吃太热致、刺激性的食物。加强康复锻炼，用药时间不宜过长也不要频繁换药。',
    '忌食辛辣、酒类食品，避免过度劳累、保持情绪稳定，同时需要每年进行定期检查。',
    '不适宜饮用大量水分，更不能喝酒。根据情况选择盐的限制，控制 proteinuria、适度运动、避免中药乱用。',
    '忌烟酒、注意饮食素质和卫生干净、控制脂肪等药物的摄入、摄生保健等。']
  }

for i in fd.items():
    n = len(i[1])
    if n<102:
        s1 = 102//n+1
    fd[i[0]] = i[1]*s1

root = 'datas/'
path = r'/home/datas/医院数据/master_data/'
df = pd.DataFrame()
for i in os.listdir(path):
    try:
        df = pd.concat([df, pd.read_csv(path+i)],axis=1)
    except:
        print(i)

transposed = list(zip_longest(*fd.values(), fillvalue=''))
df = pd.concat([df, pd.DataFrame(columns=fd.keys(),data=transposed)],axis=1)
print(df.columns)
print(df.info())

df = pd.concat([pd.read_csv(root+'data_5k.csv').sample(102).set_index(df[:102].index), df[:102]],axis=1)
def split_data(df, train_percent=0.9):
    train_size = int(len(df) * train_percent)
    val_size = len(df) - train_size
    df_train, df_val = train_test_split(df, train_size=train_size, test_size=val_size, random_state=42)
    return df_train, df_val

df_train, df_val = split_data(df)
df_train.to_csv(root+'train.csv', index=False)
df_val.to_csv(root+'dev.csv', index=False)


